<map version="freeplane 1.11.1">
<!--To view this file, download free mind mapping software Freeplane from https://www.freeplane.org -->
<node TEXT="ГОСТ Р 56939-2016" FOLDED="false" ID="ID_696401721" CREATED="1610381621824" MODIFIED="1685365604673" STYLE="oval">
<font SIZE="18"/>
<hook NAME="MapStyle" zoom="0.9">
    <properties edgeColorConfiguration="#808080ff,#ff0000ff,#0000ffff,#00ff00ff,#ff00ffff,#00ffffff,#7c0000ff,#00007cff,#007c00ff,#7c007cff,#007c7cff,#7c7c00ff" fit_to_viewport="false" associatedTemplateLocation="template:/standard-1.6.mm"/>

<map_styles>
<stylenode LOCALIZED_TEXT="styles.root_node" STYLE="oval" UNIFORM_SHAPE="true" VGAP_QUANTITY="24 pt">
<font SIZE="24"/>
<stylenode LOCALIZED_TEXT="styles.predefined" POSITION="bottom_or_right" STYLE="bubble">
<stylenode LOCALIZED_TEXT="default" ID="ID_271890427" ICON_SIZE="12 pt" COLOR="#000000" STYLE="fork">
<arrowlink SHAPE="CUBIC_CURVE" COLOR="#000000" WIDTH="2" TRANSPARENCY="200" DASH="" FONT_SIZE="9" FONT_FAMILY="SansSerif" DESTINATION="ID_271890427" STARTARROW="NONE" ENDARROW="DEFAULT"/>
<font NAME="SansSerif" SIZE="10" BOLD="false" ITALIC="false"/>
<richcontent CONTENT-TYPE="plain/auto" TYPE="DETAILS"/>
<richcontent TYPE="NOTE" CONTENT-TYPE="plain/auto"/>
</stylenode>
<stylenode LOCALIZED_TEXT="defaultstyle.details"/>
<stylenode LOCALIZED_TEXT="defaultstyle.attributes">
<font SIZE="9"/>
</stylenode>
<stylenode LOCALIZED_TEXT="defaultstyle.note" COLOR="#000000" BACKGROUND_COLOR="#ffffff" TEXT_ALIGN="LEFT"/>
<stylenode LOCALIZED_TEXT="defaultstyle.floating">
<edge STYLE="hide_edge"/>
<cloud COLOR="#f0f0f0" SHAPE="ROUND_RECT"/>
</stylenode>
<stylenode LOCALIZED_TEXT="defaultstyle.selection" BACKGROUND_COLOR="#afd3f7" BORDER_COLOR_LIKE_EDGE="false" BORDER_COLOR="#afd3f7"/>
</stylenode>
<stylenode LOCALIZED_TEXT="styles.user-defined" POSITION="bottom_or_right" STYLE="bubble">
<stylenode LOCALIZED_TEXT="styles.topic" COLOR="#18898b" STYLE="fork">
<font NAME="Liberation Sans" SIZE="10" BOLD="true"/>
</stylenode>
<stylenode LOCALIZED_TEXT="styles.subtopic" COLOR="#cc3300" STYLE="fork">
<font NAME="Liberation Sans" SIZE="10" BOLD="true"/>
</stylenode>
<stylenode LOCALIZED_TEXT="styles.subsubtopic" COLOR="#669900">
<font NAME="Liberation Sans" SIZE="10" BOLD="true"/>
</stylenode>
<stylenode LOCALIZED_TEXT="styles.important" ID="ID_67550811">
<icon BUILTIN="yes"/>
<arrowlink COLOR="#003399" TRANSPARENCY="255" DESTINATION="ID_67550811"/>
</stylenode>
</stylenode>
<stylenode LOCALIZED_TEXT="styles.AutomaticLayout" POSITION="bottom_or_right" STYLE="bubble">
<stylenode LOCALIZED_TEXT="AutomaticLayout.level.root" COLOR="#000000" STYLE="oval" SHAPE_HORIZONTAL_MARGIN="10 pt" SHAPE_VERTICAL_MARGIN="10 pt">
<font SIZE="18"/>
</stylenode>
<stylenode LOCALIZED_TEXT="AutomaticLayout.level,1" COLOR="#0033ff">
<font SIZE="16"/>
</stylenode>
<stylenode LOCALIZED_TEXT="AutomaticLayout.level,2" COLOR="#00b439">
<font SIZE="14"/>
</stylenode>
<stylenode LOCALIZED_TEXT="AutomaticLayout.level,3" COLOR="#990000">
<font SIZE="12"/>
</stylenode>
<stylenode LOCALIZED_TEXT="AutomaticLayout.level,4" COLOR="#111111">
<font SIZE="10"/>
</stylenode>
<stylenode LOCALIZED_TEXT="AutomaticLayout.level,5"/>
<stylenode LOCALIZED_TEXT="AutomaticLayout.level,6"/>
<stylenode LOCALIZED_TEXT="AutomaticLayout.level,7"/>
<stylenode LOCALIZED_TEXT="AutomaticLayout.level,8"/>
<stylenode LOCALIZED_TEXT="AutomaticLayout.level,9"/>
<stylenode LOCALIZED_TEXT="AutomaticLayout.level,10"/>
<stylenode LOCALIZED_TEXT="AutomaticLayout.level,11"/>
</stylenode>
</stylenode>
</map_styles>
</hook>
<hook NAME="AutomaticEdgeColor" COUNTER="8" RULE="ON_BRANCH_CREATION"/>
<node TEXT="Область применения" POSITION="bottom_or_right" ID="ID_1689250834" CREATED="1685365781531" MODIFIED="1685366849869" HGAP_QUANTITY="92.75 pt" VSHIFT_QUANTITY="302.99999 pt">
<edge COLOR="#0000ff"/>
<node TEXT="Настоящий стандарт устанавливает общие требования к содержанию и порядку выполнения работ, связанных с созданием безопасного (защищенного) программного обеспечения и формированием (поддержанием) среды обеспечения оперативного устранения выявленных пользователями ошибок программного обеспечения и уязвимостей программы." ID="ID_106505495" CREATED="1685365591678" MODIFIED="1685366845705" HGAP_QUANTITY="23.75 pt" VSHIFT_QUANTITY="9 pt" COLOR="#000000">
<font SIZE="8"/>
</node>
<node TEXT="Настоящий стандарт предназначен для разработчиков и производителей программного обеспечения, а также для организаций, выполняющих оценку соответствия процесса разработки программного обеспечения требованиям настоящего стандарта." ID="ID_1820496390" CREATED="1685365962286" MODIFIED="1685366841194" HGAP_QUANTITY="23 pt" VSHIFT_QUANTITY="1.5 pt">
<font SIZE="8"/>
</node>
<node TEXT="Настоящий стандарт можно применять в качестве источника для формирования мер и средств контроля и управления безопасностью программного обеспечения в соответствии с ГОСТ Р ИСО/МЭК 27034-1. Настоящий стандарт можно использовать для конкретизации или расширения компонентов доверия из ГОСТ Р ИСО/МЭК 15408-3." ID="ID_915766306" CREATED="1685366020516" MODIFIED="1685366839681" HGAP_QUANTITY="23.75 pt" VSHIFT_QUANTITY="-33 pt">
<font SIZE="8"/>
</node>
</node>
<node TEXT=" Нормативные ссылки" POSITION="top_or_left" ID="ID_1581270503" CREATED="1685366060190" MODIFIED="1685367305636" HGAP_QUANTITY="-226.74999 pt" VSHIFT_QUANTITY="1784.99995 pt">
<edge COLOR="#00ff00"/>
<node TEXT="ГОСТ 2.001 Единая система конструкторской документации. Общие положения" ID="ID_414762690" CREATED="1685366076388" MODIFIED="1685366090491">
<font SIZE="8"/>
</node>
<node TEXT="ГОСТ 19.101 Единая система программной документации. Виды программ и программных документов" ID="ID_888479654" CREATED="1685366093125" MODIFIED="1685366105746">
<font SIZE="8"/>
</node>
<node TEXT="ГОСТ 19.201  Единая система программной документации. Техническое задание. Требования к содержанию и оформлению" ID="ID_937112110" CREATED="1685366109790" MODIFIED="1685366157065">
<font SIZE="8"/>
</node>
<node TEXT="ГОСТ 19.402  Единая система программной документации. Описание программы" ID="ID_338741257" CREATED="1685366123605" MODIFIED="1685366170140">
<font SIZE="8"/>
</node>
<node TEXT="ГОСТ 19.404  Единая система программной документации. Пояснительная записка. Требования к содержанию и оформлению" ID="ID_1038326836" CREATED="1685366126276" MODIFIED="1685366180559">
<font SIZE="8"/>
</node>
<node TEXT="ГОСТ Р ИСО/МЭК 15408-1-  Информационная технология. Методы и средства обеспечения безопасности. Критерии оценки безопасности информационных технологий. Часть 1. Введение и общая модель" ID="ID_884531919" CREATED="1685366127844" MODIFIED="1685366191383">
<font SIZE="8"/>
</node>
<node TEXT="ГОСТ Р ИСО/МЭК 15408-2  Информационная технология. Методы и средства обеспечения безопасности. Критерии оценки безопасности информационных технологий. Часть 2. Функциональные компоненты безопасности" ID="ID_880305786" CREATED="1685366129478" MODIFIED="1685367248646" VSHIFT_QUANTITY="6 pt">
<font SIZE="8"/>
</node>
<node TEXT="ГОСТ Р ИСО/МЭК 15408-3  Информационная технология. Методы и средства обеспечения безопасности. Критерии оценки безопасности информационных технологий. Часть 3. Компоненты доверия к безопасности" ID="ID_975669168" CREATED="1685366131831" MODIFIED="1685366215736">
<font SIZE="8"/>
</node>
<node TEXT="ГОСТ Р ИСО 10007  Менеджмент организации. Руководящие указания по управлению конфигурацией" ID="ID_826462664" CREATED="1685366133982" MODIFIED="1685366225247">
<font SIZE="8"/>
</node>
<node TEXT="ГОСТ Р ИСО/МЭК 12207  Информационная технология. Системная и программная инженерия. Процессы жизненного цикла программных средств" ID="ID_776623984" CREATED="1685366135964" MODIFIED="1685366235288">
<font SIZE="8"/>
</node>
<node TEXT="ГОСТ Р ИСО/МЭК 27001  Информационная технология. Методы и средства обеспечения безопасности. Системы менеджмента информационной безопасности. Требования" ID="ID_21956658" CREATED="1685366137422" MODIFIED="1685366247703">
<font SIZE="8"/>
</node>
<node TEXT="ГОСТ Р ИСО/МЭК 27034-1  Информационная технология. Методы и средства обеспечения безопасности. Безопасность приложений. Часть 1. Обзор и общие понятия" ID="ID_1379277107" CREATED="1685366139083" MODIFIED="1685366259038">
<font SIZE="8"/>
</node>
</node>
<node TEXT="Термины и определения" POSITION="bottom_or_right" ID="ID_1742013324" CREATED="1685366363208" MODIFIED="1685366880271" HGAP_QUANTITY="93.5 pt" VSHIFT_QUANTITY="-209.24999 pt">
<edge COLOR="#ff00ff"/>
<node TEXT="безопасность информации" ID="ID_1302424411" CREATED="1685366384525" MODIFIED="1685366701696">
<font SIZE="10"/>
</node>
<node TEXT="безопасное программное обеспечение" ID="ID_1604799092" CREATED="1685366399138" MODIFIED="1685366407523"/>
<node TEXT="динамический анализ кода программы" ID="ID_1954075518" CREATED="1685366408832" MODIFIED="1685366416426"/>
<node TEXT="документация разработчика программного обеспечения" ID="ID_1517646335" CREATED="1685366417422" MODIFIED="1685366424391"/>
<node TEXT="инструментальное средство" ID="ID_987941803" CREATED="1685366426996" MODIFIED="1685366436236"/>
<node TEXT="компьютерная атака" ID="ID_1066493797" CREATED="1685366437658" MODIFIED="1685366443492"/>
<node TEXT="недостаток программы" ID="ID_915904279" CREATED="1685366444561" MODIFIED="1685366452170"/>
<node TEXT="объект среды разработки программного обеспечения" ID="ID_486108474" CREATED="1685366453415" MODIFIED="1685366462152"/>
<node TEXT="пользователь (программного обеспечения)" ID="ID_563882725" CREATED="1685366463117" MODIFIED="1685366471807"/>
<node TEXT="программа" ID="ID_1925386401" CREATED="1685366473155" MODIFIED="1685366480748"/>
<node TEXT="программное обеспечение" ID="ID_1255770226" CREATED="1685366481842" MODIFIED="1685366488355"/>
<node TEXT="сетевая атака" ID="ID_581677575" CREATED="1685366489792" MODIFIED="1685366496047"/>
<node TEXT="система управления конфигурацией программного обеспечения" ID="ID_92127018" CREATED="1685366497663" MODIFIED="1685366505665"/>
<node TEXT="среда разработки программного обеспечения" ID="ID_453392693" CREATED="1685366507173" MODIFIED="1685366513871"/>
<node TEXT="статический анализ исходного кода программы" ID="ID_1577969024" CREATED="1685366514883" MODIFIED="1685366550222"/>
<node TEXT="тестирование на проникновение" ID="ID_1648375144" CREATED="1685366551372" MODIFIED="1685366558466"/>
<node TEXT="угроза (безопасности информации)" ID="ID_1621433185" CREATED="1685366559786" MODIFIED="1685366566172"/>
<node TEXT="управление конфигурацией программного обеспечения" ID="ID_1844136066" CREATED="1685366567537" MODIFIED="1685366577641"/>
<node TEXT="уязвимость программы" ID="ID_1752873963" CREATED="1685366579655" MODIFIED="1685366587336"/>
<node TEXT="функциональное тестирование программы" ID="ID_212326226" CREATED="1685366588453" MODIFIED="1685366597333"/>
<node TEXT="фаззинг-тестирование программы" ID="ID_1180971268" CREATED="1685366598755" MODIFIED="1685366609049"/>
<node TEXT="экспертиза исходного кода программы" ID="ID_1800308971" CREATED="1685366616583" MODIFIED="1685366625117"/>
<node TEXT="электронный документ" ID="ID_889671287" CREATED="1685366626493" MODIFIED="1685366632462"/>
<node TEXT="элемент конфигурации" ID="ID_1088054404" CREATED="1685366633812" MODIFIED="1685366641238"/>
</node>
<node TEXT="Общие положения" POSITION="top_or_left" ID="ID_1368046572" CREATED="1685366954102" MODIFIED="1685367309516" HGAP_QUANTITY="378.49999 pt" VSHIFT_QUANTITY="-2342.99993 pt">
<edge COLOR="#007c00"/>
<node TEXT="Предотвращение появления и устранение уязвимостей программы может быть достигнуто путем реализации разработчиком программного обеспечения (ПО) мер по разработке безопасного ПО в процессах жизненного цикла ПО, установленных ГОСТ Р ИСО/МЭК 12207." ID="ID_1760333786" CREATED="1685366958924" MODIFIED="1685366969245">
<font SIZE="8"/>
</node>
<node TEXT="Меры по разработке безопасного ПО, представленные в настоящем стандарте, выражены в форме требования, рекомендации или допустимого действия, предназначенных для поддержки достижения результатов реализации мер. Для этой цели в настоящем стандарте используют вспомогательные глаголы &quot;должен&quot;, &quot;следует&quot; и &quot;может&quot;, чтобы подчеркнуть различие между разными формами требований к реализации мер. Глагол &quot;должен&quot; использован для выражения условия, требуемого для соответствия, &quot;следует&quot; - для выражения рекомендации среди других возможностей, &quot;может&quot; - для того, чтобы отразить направление допустимых действий в пределах ограничений настоящего стандарта." ID="ID_1643438763" CREATED="1685366970955" MODIFIED="1685366984442">
<font SIZE="8"/>
</node>
<node TEXT="Разработчик ПО должен определить и документировать цели организации в области создания безопасного ПО и меры по разработке безопасного ПО, реализация которых направлена на достижение поставленных целей." ID="ID_1960937348" CREATED="1685366986752" MODIFIED="1685366994862">
<font SIZE="8"/>
</node>
<node TEXT="Для соответствия требованиям настоящего стандарта разработчик ПО должен обеспечить реализацию и проводить внутренние проверки мер по разработке безопасного ПО, приведенных в разделе 5 (базовый набор мер по разработке безопасного ПО), в процессах жизненного цикла ПО, установленных ГОСТ Р ИСО/МЭК 12207, а также работать над улучшением процессов, связанных с разработкой безопасного ПО." ID="ID_1663473572" CREATED="1685366996918" MODIFIED="1685367009733">
<font SIZE="8"/>
</node>
<node TEXT="При невозможности реализации в среде разработки ПО отдельных мер из базового набора мер по разработке безопасного ПО разработчик ПО может разрабатывать и реализовывать иные (компенсирующие) меры по разработке безопасного ПО, обеспечивающие достижение целей и получение результатов, соответствующих базовому набору мер по разработке безопасного ПО." ID="ID_276900712" CREATED="1685367012147" MODIFIED="1685367020715">
<font SIZE="8"/>
</node>
<node TEXT="Если разработчик ПО планирует проведение оценки ПО в соответствии с ГОСТ Р ИСО/МЭК 15408-1, ГОСТ Р ИСО/МЭК 15408-2, ГОСТ Р ИСО/МЭК 15408-3, то подготовку ПО к оценке можно осуществлять в рамках действующих процессов, в которых реализованы меры по разработке безопасного ПО, путем выполнения дополнительных мер. В таблице А.1 приложения А отображена взаимосвязь мер по разработке безопасного ПО, установленных настоящим стандартом, и требований доверия к безопасности по ГОСТ Р ИСО/МЭК 15408-3, которую можно использовать при подготовке ПО к оценке по ГОСТ Р ИСО/МЭК 15408-1, ГОСТ Р ИСО/МЭК 15408-2, ГОСТ Р ИСО/МЭК 15408-3." ID="ID_804067735" CREATED="1685367023928" MODIFIED="1685367032528">
<font SIZE="8"/>
</node>
<node TEXT="Разработчик ПО должен предусмотреть выделение ресурсов, необходимых для реализации мер по разработке безопасного ПО, и обеспечить реализацию этих мер." ID="ID_834820211" CREATED="1685367035774" MODIFIED="1685367046454">
<font SIZE="8"/>
</node>
<node TEXT="Разработчик ПО должен проводить внутренние проверки выполнения мер по разработке безопасного ПО, позволяющие установить, что реализуемые меры соответствуют требованиям настоящего стандарта." ID="ID_1756005974" CREATED="1685367047932" MODIFIED="1685367054867">
<font SIZE="8"/>
</node>
<node TEXT="Разработчик ПО должен проводить улучшения процессов, связанных с разработкой безопасного ПО, на основе:&#xa;- несоответствий, выявленных в ходе внутренних проверок;&#xa;- изменения целей разработчика ПО в области разработки безопасного ПО." ID="ID_1231442463" CREATED="1685367056970" MODIFIED="1685367074880">
<font SIZE="8"/>
</node>
<node TEXT="Разработчик ПО должен создать руководство по разработке безопасного ПО, содержащее:&#xa;- описание области действия руководства (идентификационные признаки ПО, для которого реализуют меры по разработке безопасного ПО);&#xa;- цели организации в области создания безопасного ПО;&#xa;- перечень и описание мер по разработке безопасного ПО, подлежащих реализации в среде разработки ПО;&#xa;- распределение ролей и обязанностей, связанных с реализацией мер по разработке безопасного ПО, между работниками;&#xa;- перечень документации разработчика ПО, связанной с реализацией мер по разработке безопасного ПО;&#xa;- правила и требования, относящиеся к планированию и проведению внутренних проверок реализации мер по разработке безопасного ПО, сообщений о результатах;&#xa;- описание действий, направленных на улучшение процессов, связанных с разработкой безопасного ПО.&#xa;При реализации компенсирующих мер по разработке безопасного ПО в руководстве по разработке безопасного ПО должно быть приведено обоснование применения компенсирующих мер, включающее:&#xa;- изложение причин исключения меры (мер) по разработке безопасного ПО;&#xa;- описание содержания компенсирующих мер по разработке безопасного ПО;&#xa;- сравнительный анализ компенсирующих мер по разработке безопасного ПО с мерами, исключаемыми из состава базового набора мер по разработке безопасного ПО;&#xa;- аргументацию, подтверждающую, что предлагаемые компенсирующие меры разработки безопасного ПО обеспечивают достижение целей, соответствующих исключаемым мерам по разработке безопасного ПО." ID="ID_308730601" CREATED="1685367077806" MODIFIED="1685367119322">
<font SIZE="8"/>
</node>
<node TEXT=" Руководство по разработке безопасного ПО должно быть утверждено руководством организации, издано и доведено до сведения всех сотрудников организации, имеющих отношение к разработке безопасного ПО. Руководство по разработке безопасного ПО должны периодически анализировать и пересматривать, руководствуясь:&#xa;- выявленными в ходе внутренних проверок несоответствиями;&#xa;- изменениями целей разработчика ПО в области разработки безопасного ПО." ID="ID_1530680339" CREATED="1685367132380" MODIFIED="1685367151411">
<font SIZE="8"/>
</node>
<node TEXT="Разработка документации разработчика ПО, связанной с реализацией мер по разработке безопасного ПО, может быть направлена:&#xa;- на организацию работ по созданию безопасного ПО, выполняемых в рамках процессов жизненного цикла ПО;&#xa;- подтверждение соответствия требованиям настоящего стандарта.&#xa;В перечень документации разработчика ПО могут входить эксплуатационные документы, а также документ:&#xa;- содержащий требования по безопасности, предъявляемые к разрабатываемому ПО;&#xa;- содержащий сведения о результатах моделирования угроз безопасности информации;&#xa;- содержащий сведения о проекте архитектуры программы;&#xa;- описывающий используемые инструментальные средства;&#xa;- содержащий информацию о прослеживаемости исходного кода программы к проекту архитектуры программы;&#xa;- содержащий порядок оформления исходного кода программы;&#xa;- содержащий сведения о результатах проведения статического анализа исходного кода программы;&#xa;- содержащий сведения о результатах проведения экспертизы исходного кода программы;&#xa;- содержащий сведения о результатах проведения функционального тестирования программы;&#xa;- содержащий сведения о результатах проведения тестирования на проникновение;&#xa;- содержащий сведения о результатах проведения динамического анализа кода программы;&#xa;- содержащий сведения о результатах проведения фаззинг-тестирования программы;&#xa;- содержащий описание процедуры передачи ПО пользователю;&#xa;- содержащий описание процедур отслеживания и исправления обнаруженных ошибок ПО и уязвимостей программы;&#xa;- содержащий описание процедуры поиска разработчиком ПО уязвимостей программы;&#xa;- описывающий реализацию и использование процедуры уникальной маркировки каждой версии ПО;&#xa;- описывающий использование системы управления конфигурацией ПО;&#xa;- описывающий меры, используемые для защиты инфраструктуры среды разработки ПО;&#xa;- содержащий сведения об обучении сотрудников." ID="ID_1274238414" CREATED="1685367153727" MODIFIED="1685367220344">
<font SIZE="8"/>
</node>
<node TEXT="Разработчик ПО должен определить и документировать политику информационной безопасности в соответствии с ГОСТ Р ИСО/МЭК 27001. Разработчик ПО должен соблюдать в своей деятельности, связанной с разработкой безопасного ПО, требования, установленные в политике информационной безопасности организации." ID="ID_954247600" CREATED="1685367223025" MODIFIED="1685367231393">
<font SIZE="8"/>
</node>
</node>
</node>
</map>
